# Dataframe

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(5,4),index = 'A B C D E '.split(),columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A -0.543842  0.236797 -0.649187 -1.801317
B  1.876591 -0.922546 -1.741445  1.234202
C  1.596500 -0.498192  0.967401 -1.391016
D -2.075238 -0.198001  0.636461  0.493416
E  1.564363  0.545597  0.775113  0.490137

In [5]:
df[['W','Y']]

          W         Y
A -0.543842 -0.649187
B  1.876591 -1.741445
C  1.596500  0.967401
D -2.075238  0.636461
E  1.564363  0.775113

In [6]:
df['new'] = df ['W'] + df ['Y']
df

          W         X         Y         Z       new
A -0.543842  0.236797 -0.649187 -1.801317 -1.193030
B  1.876591 -0.922546 -1.741445  1.234202  0.135146
C  1.596500 -0.498192  0.967401 -1.391016  2.563901
D -2.075238 -0.198001  0.636461  0.493416 -1.438777
E  1.564363  0.545597  0.775113  0.490137  2.339476

In [7]:
df.drop('new',axis = 1, inplace = False)

          W         X         Y         Z
A -0.543842  0.236797 -0.649187 -1.801317
B  1.876591 -0.922546 -1.741445  1.234202
C  1.596500 -0.498192  0.967401 -1.391016
D -2.075238 -0.198001  0.636461  0.493416
E  1.564363  0.545597  0.775113  0.490137

In [8]:
df

          W         X         Y         Z       new
A -0.543842  0.236797 -0.649187 -1.801317 -1.193030
B  1.876591 -0.922546 -1.741445  1.234202  0.135146
C  1.596500 -0.498192  0.967401 -1.391016  2.563901
D -2.075238 -0.198001  0.636461  0.493416 -1.438777
E  1.564363  0.545597  0.775113  0.490137  2.339476

In [9]:
df.drop('new',axis = 1, inplace = True)

In [10]:
df

          W         X         Y         Z
A -0.543842  0.236797 -0.649187 -1.801317
B  1.876591 -0.922546 -1.741445  1.234202
C  1.596500 -0.498192  0.967401 -1.391016
D -2.075238 -0.198001  0.636461  0.493416
E  1.564363  0.545597  0.775113  0.490137

In [12]:
df

          W         X         Y         Z
A -0.543842  0.236797 -0.649187 -1.801317
B  1.876591 -0.922546 -1.741445  1.234202
C  1.596500 -0.498192  0.967401 -1.391016
D -2.075238 -0.198001  0.636461  0.493416
E  1.564363  0.545597  0.775113  0.490137

In [22]:
df.iloc[4]

W    1.564363
X    0.545597
Y    0.775113
Z    0.490137
Name: E, dtype: float64

In [24]:
df['X'].mean()

-0.1672689022705232

In [25]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.483675 -0.167269 -0.002331 -0.194916
std    1.728461  0.581452  1.161443  1.322560
min   -2.075238 -0.922546 -1.741445 -1.801317
25%   -0.543842 -0.498192 -0.649187 -1.391016
50%    1.564363 -0.198001  0.636461  0.490137
75%    1.596500  0.236797  0.775113  0.493416
max    1.876591  0.545597  0.967401  1.234202

In [26]:
train = pd.read_csv('titanic_train.csv')

In [31]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [33]:
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [34]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [35]:
df

          W         X         Y         Z
A -0.543842  0.236797 -0.649187 -1.801317
B  1.876591 -0.922546 -1.741445  1.234202
C  1.596500 -0.498192  0.967401 -1.391016
D -2.075238 -0.198001  0.636461  0.493416
E  1.564363  0.545597  0.775113  0.490137

In [36]:
train.columns[train.isnull().any()]

Index(['Age', 'Cabin', 'Embarked'], dtype='object')

In [37]:
train.columns[train.isnull().all()]

Index([], dtype='object')

In [38]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S